---
kind: property
id: P:Autodesk.Revit.DB.DoubleArray.IsEmpty
source: html/9515eb9e-c408-49cb-273c-b12aa28a0dce.htm
---
# Autodesk.Revit.DB.DoubleArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.